ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2350/ZuluIDE_platform.cpp
    // Get flash chip unique ID
    // (flash_get_unique_id() from RP2040 libs didn't work for some reason)
    uint8_t cmd_read_uniq_id[13] = {0x4B};
    uint8_t response_uniq_id[13] = {0};
    flash_do_cmd(cmd_read_uniq_id, response_uniq_id, 13);
    memcpy(&g_flash_unique_id, response_uniq_id + 5, 8);
    logmsg("Flash unique ID: ", g_flash_unique_id);
#endif

    // SD card pins
    // Card is used in SDIO mode, rp2040_sdio.cpp will redirect these to PIO1
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(SDIO_CLK,       GPIO_FUNC_SIO, true, false, true,  true, true);
    gpio_conf(SDIO_CMD,       GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D0,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D1,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D2,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D3,        GPIO_FUNC_SIO, true, false, false, true, true);

    // I2C pins
    //        pin                 function       pup   pdown  out    state fast
    gpio_conf(GPIO_I2C_SCL,       GPIO_FUNC_I2C, true, false, false,  true, true);
    gpio_conf(GPIO_I2C_SDA,       GPIO_FUNC_I2C, true, false, false,  true, true);

    // IDE bus control signals
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(CTRL_LOAD,      GPIO_FUNC_SIO, false, false, true,  false, true);
    gpio_conf(CTRL_nEN,       GPIO_FUNC_SIO, false, false, true,  true,  true);
    gpio_conf(CTRL_IN_SEL,    GPIO_FUNC_SIO, false, false, true,  true,  true);
    gpio_conf(IDE_DATASEL,    GPIO_FUNC_SIO, false, false, true,  true, true);
    gpio_conf(IDE_DATADIR,    GPIO_FUNC_SIO, false, false, true,  false, true);
    gpio_conf(IDE_IORDY_OUT,  GPIO_FUNC_SIO, false, false, true,  false, true);
    gpio_conf(IDE_IORDY_EN,   GPIO_FUNC_SIO, false, false, true,  true,  true);
    gpio_conf(IDE_IOCS16,     GPIO_FUNC_SIO, false, false, true,  true,  true);

    // IDE bus status signals
    gpio_conf(IDE_RST,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DIOW,       GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DIOR,       GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DA0,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DA1,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DA2,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_CS0,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_CS1,        GPIO_FUNC_SIO, false, false, false, false, true);
    gpio_conf(IDE_DMACK,      GPIO_FUNC_SIO, false, false, false, false, true);

    // IDE bus data signals
    for (int i = 0; i < 16; i++)
    {
        gpio_conf(IDE_D0 + i, GPIO_FUNC_SIO, false, false, false, false, true);
    }

    // Status LED
    gpio_conf(STATUS_LED,     GPIO_FUNC_SIO, false,false, true,  false, false);
}

#ifdef ENABLE_AUDIO_OUTPUT
// Increases clk_sys and clk_peri to 200.4MHz at runtime to support
// division to audio output rates. Invoke before anything is using clk_peri
// except for the logging UART, which is handled below.
static void reclock_for_audio() {
    // ensure UART is fully drained before we mess up its clock
    uart_tx_wait_blocking(uart0);
    // switch clk_sys and clk_peri to pll_usb
    // see code in 2.15.6.1 of the datasheet for useful comments
    clock_configure(clk_sys,
            CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
            CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB,
            48 * MHZ,
            48 * MHZ);
    clock_configure(clk_peri,
            0,
            CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_PLL_USB,
            48 * MHZ,
            48 * MHZ);
    // reset PLL for 200.4MHz sys clock
    pll_init(pll_sys, 2, 1002000000, 5, 1);
    // switch clocks back to pll_sys
    clock_configure(clk_sys,
            CLOCKS_CLK_SYS_CTRL_SRC_VALUE_CLKSRC_CLK_SYS_AUX,
            CLOCKS_CLK_SYS_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS,
            200400000,
            200400000);
    clock_configure(clk_peri,
            0,
            CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_CLKSRC_PLL_SYS,
            200400000,
            200400000);
    // reset UART for the new clock speed
    uart_init(uart0, 1000000);
}
#endif

// late_init() only runs in main application
void platform_late_init()
{
#ifdef ENABLE_AUDIO_OUTPUT
    reclock_for_audio();
    audio_init();
#endif
    logmsg("System clock is set to ", (int) clock_get_hz(clk_sys), " Hz");
      USB.begin();
}

void platform_write_led(bool state)
{
    if (g_led_disabled || g_led_blinking) return;
    
    gpio_put(STATUS_LED, state);
}

void platform_set_blink_status(bool status)
{
    g_led_blinking = status;
}

void platform_write_led_override(bool state)
{
    if (g_led_disabled) return;

    gpio_put(STATUS_LED, state);

}
void platform_disable_led(void)
{   
    g_led_disabled = true;
    logmsg("Disabling status LED");
}

void platform_init_eject_button(uint8_t eject_button)
{
    if (eject_button & 1)
    {
        //        pin                   function       pup   pdown  out    state fast
        gpio_conf(GPIO_EJECT_BTN_1_PIN, GPIO_FUNC_SIO, true, false, false, true, false);
        g_eject_buttons |= 1;
    }

    if (eject_button & 2)
    {
        gpio_conf(GPIO_EJECT_BTN_2_PIN, GPIO_FUNC_SIO, true, false, false, true, false);
        g_eject_buttons |= 2;
    }
}

uint8_t platform_get_buttons()
{
    uint8_t buttons = 0;

    if ((g_eject_buttons & 1) && (!gpio_get(GPIO_EJECT_BTN_1_PIN))) 
        buttons |= 1;
    if ((g_eject_buttons & 2) && !gpio_get(GPIO_EJECT_BTN_2_PIN)) 
        buttons |= 2;

    // Simple debouncing logic: handle button releases after 100 ms delay.
    static uint32_t debounce;
    static uint8_t buttons_debounced = 0;

    if (buttons != 0)
    {
        buttons_debounced = buttons;
        debounce = millis();
    }
    else if ((uint32_t)(millis() - debounce) > 100)
    {
        buttons_debounced = 0;
    }

