ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2350/ZuluIDE_platform.cpp
    return buttons_debounced;
}

int platform_get_device_id(void)
{
    if (g_dip_cable_sel)
    {
        if (g_cable_sel_state)
            return 1;    // CSEL wire has been cut, secondary device
        else
            return 0;    // CSEL wire grounded, primary device
    }
    else
    {
        if (g_dip_drive_id)
            return 1;    // PRI/SEC switch on, secondary device
        else
            return 0;    // PRI/SEC switch off, primary device
    }
}

/****************************************/
/* Direct serial access                 */
/************************************** */
bool platform_serial_ready()
{
    return Serial.availableForWrite();
}

size_t platform_serial_write(uint8_t *buf, size_t len)
{
    return Serial.write(buf, len);
}

/*****************************************/
/* Crash handlers                        */
/*****************************************/


extern uint32_t __StackTop;
static void usb_log_poll();

void platform_emergency_log_save()
{
    volatile uint core_num = get_core_num();
    if (core_num != 0)
    {
        logmsg("Only core 0 may attempt 'platform_emergency_log_save()'");
        return;
    }

    platform_set_sd_callback(NULL, NULL);

    SD.begin(SD_CONFIG_CRASH);
    FsFile crashfile = SD.open(CRASHFILE, O_WRONLY | O_CREAT | O_TRUNC);

    if (!crashfile.isOpen())
    {
        // Try to reinitialize
        int max_retry = 10;
        while (max_retry-- > 0 && !SD.begin(SD_CONFIG_CRASH));

        crashfile = SD.open(CRASHFILE, O_WRONLY | O_CREAT | O_TRUNC);
    }

    uint32_t startpos = 0;
    crashfile.write(log_get_buffer(&startpos));
    crashfile.write(log_get_buffer(&startpos));
    crashfile.flush();
    crashfile.close();
}

static void dump_stack(uint32_t *sp)
{
    uint32_t *p = (uint32_t*)((uint32_t)sp & ~3);

    for (int i = 0; i < 16; i++)
    {
        if (p == &__StackTop) break; // End of stack

        logmsg("STACK ", (uint32_t)p, ":    ", p[0], " ", p[1], " ", p[2], " ", p[3]);
        p += 4;
    }
}

static const char *cfsr_desc(uint32_t cfsr)
{
    if (cfsr & 0x000000FF) return "MemManage";
    if (cfsr & 0x0000FF00) return "BusFault";
    if (cfsr & 0x00010000) return "UndefInstr";
    if (cfsr & 0x00100000) return "StackOverflow";
    if (cfsr & 0x01000000) return "Unaligned";
    if (cfsr & 0x02000000) return "DivByZero";
    if (cfsr) return "Fault";
    return "No fault";
}

extern "C" __attribute__((noinline))
void show_hardfault(uint32_t *sp, uint32_t r4, uint32_t r5, uint32_t r6,
    uint32_t r7, uint32_t r8, uint32_t r9, uint32_t r10, uint32_t r11)
{
    uint32_t pc = sp[6];
    uint32_t lr = sp[5];

    // When the main firmware is run in non-secure mode, the secure mode
    // fault handler forwards to us. It stores context in r4-r7.
    bool sec_fault = (r4 == 0xACCE55ED);

    logmsg("--------------");
    logmsg("CRASH!");
    logmsg("Platform: ", g_platform_name);
    logmsg("FW Version: ", g_log_firmwareversion);
    logmsg("CFSR: ", (uint32_t)scb_hw->cfsr, " ", cfsr_desc(scb_hw->cfsr));
    logmsg("BFAR: ", (uint32_t)scb_hw->bfar, (scb_hw->cfsr & (1 << 15)) ? " valid" : " not valid");
    logmsg("MMFAR: ", (uint32_t)scb_hw->mmfar, (scb_hw->cfsr & (1 << 7)) ? " valid" : " not valid");
    logmsg("SP: ", (uint32_t)sp);
    logmsg("PC: ", pc);
    logmsg("LR: ", lr);
    logmsg("R0: ", sp[0]);
    logmsg("R1: ", sp[1]);
    logmsg("R2: ", sp[2]);
    logmsg("R3: ", sp[3]);
    logmsg("R4: ", r4, (sec_fault ? " (SECURE FAULT)" : "")); // ARMv8-m secure mode handler forwards to us
    logmsg("R5: ", r5);
    logmsg("R6: ", r6, (sec_fault ? " (SFAR)" : ""));
    logmsg("R7: ", r7, (sec_fault ? " (SFSR)" : ""));
    logmsg("R8: ", r8);
    logmsg("R9: ", r9);
    logmsg("R10: ", r10);
    logmsg("R11: ", r11);
    logmsg("R12: ", sp[4]);

    dump_stack(sp);

    platform_emergency_log_save();

    while (1)
    {
        usb_log_poll();
        // Flash the crash address on the LED
        // Short pulse means 0, long pulse means 1
        platform_set_blink_status(false);
        int base_delay = 500;
        for (int i = 31; i >= 0; i--)
        {
            LED_OFF();
            for (int j = 0; j < base_delay; j++) busy_wait_ms(1);

            int delay = (pc & (1 << i)) ? (3 * base_delay) : base_delay;
            LED_ON();
            for (int j = 0; j < delay; j++) busy_wait_ms(1);
            LED_OFF();
        }

        for (int j = 0; j < base_delay * 10; j++) busy_wait_ms(1);
    }
}

extern "C" __attribute__((naked, interrupt))
void isr_hardfault(void)
{
    // Copies stack pointer and R4..R11 into function arguments
    // Reuses stack from beginning in case we have overflowed it (we don't need to return)
    extern uint32_t __StackTop; // From rp2350.ld
    register uint32_t stacktop asm("r1") = (uint32_t)&__StackTop;
    asm("mrs r0, msp\n"
        "msr msp, %0\n"
        "mov r1, r4\n"
        "mov r2, r5\n"
        "mov r3, r6\n"
        "stmdb sp!, {r7, r8, r9, r10, r11}\n"
        "bl show_hardfault": : "r"(stacktop) : "r0");
}

extern "C" void __assert_func(const char *file, int line, const char *func, const char *failedexpr)
{
    logmsg("Assert failed: ", file, ":", line, " ", func, " ", failedexpr);

    uint32_t stack = 0;
    dump_stack(&stack);

    platform_emergency_log_save();

    platform_set_blink_status(false);
    while(1)
    {
        usb_log_poll();
        LED_OFF();
        sleep_ms(100);
        LED_ON();
        sleep_ms(100);
    }
}

extern "C" void panic(const char *fmt, ...)
{
    logmsg("Panic: ", fmt);

    uint32_t stack = 0;
    dump_stack(&stack);

    platform_emergency_log_save();

    platform_set_blink_status(false);
    while(1)
    {
        usb_log_poll();
        LED_OFF();
        sleep_ms(100);
        LED_ON();
        sleep_ms(100);
    }
}

/*****************************************/
/* Debug logging and watchdog            */
/*****************************************/

// Send log data to USB UART if USB is connected.
// Data is retrieved from the shared log ring buffer and
// this function sends as much as fits in USB CDC buffer.
//
// This is normally called by platform_reset_watchdog() in
// the normal polling loop. If code hangs, the watchdog_callback()
// also starts calling this after 2 seconds.
// This ensures that log messages get passed even if code hangs,
// but does not unnecessarily delay normal execution.
static void usb_log_poll()
{
    static uint32_t logpos = 0;

    if (Serial.availableForWrite())
    {
        // Retrieve pointer to log start and determine number of bytes available.
        uint32_t available = 0;
        const char *data = log_get_buffer(&logpos, &available);
                // Limit to CDC packet size
        uint32_t len = available;
        if (len == 0) return;
        if (len > CFG_TUD_CDC_EP_BUFSIZE) len = CFG_TUD_CDC_EP_BUFSIZE;
        
        // Update log position by the actual number of bytes sent
        // If USB CDC buffer is full, this may be 0
        uint32_t actual = 0;
        actual = Serial.write(data, len);
        logpos -= available - actual;
    }
}

// Use ADC to implement supply voltage monitoring for the +3.0V rail.
// This works by sampling the temperature sensor channel, which has
// a voltage of 0.7 V, allowing to calculate the VDD voltage.
static void adc_poll()
{
#if PLATFORM_VDD_WARNING_LIMIT_mV > 0
    static bool initialized = false;
    static int lowest_vdd_seen = PLATFORM_VDD_WARNING_LIMIT_mV;

    if (!initialized)
    {
        adc_init();
        adc_set_temp_sensor_enabled(true);
        adc_set_clkdiv(65535); // Lowest samplerate, about 2 kHz
        adc_select_input(4);
        adc_fifo_setup(true, false, 0, false, false);
        adc_run(true);
        initialized = true;
    }

