ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2350/ZuluIDE_platform.cpp
mutex_t* platform_get_log_mutex() {
  return &logMutex;
}

/********************************/
/* Logic sniffer functionality  */
/********************************/

bool platform_enable_sniffer(const char *filename, bool passive)
{
    if (passive)
    {
        // Stop IDE phy and configure pins for passive input
        g_idecomm.enable_idephy = false;

        // Configure IDE bus for input mode
        // Data buffer is enabled in input mode.
        // Control buffer is disabled.
        for (int i = 0; i < 16; i++)
        {
            gpio_conf(IDE_D0 + i, GPIO_FUNC_SIO, false, false, false, false, true);
        }

        //        pin             function       pup   pdown  out    state fast
        gpio_conf(IDE_RST,        GPIO_FUNC_SIO, false, false, false, false, true); // Input
        gpio_conf(IDE_DIOW,       GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DIOR,       GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DA0,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DA1,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DA2,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_CS0,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_CS1,        GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(IDE_DMACK,      GPIO_FUNC_SIO, false, false, false, false, true);
        gpio_conf(CTRL_LOAD,      GPIO_FUNC_SIO, false, false, true, false, true); // Don't load ctrl mux
        gpio_conf(CTRL_nEN,       GPIO_FUNC_SIO, false, false, true, true, true);  // Disable ctrl mux
        gpio_conf(CTRL_IN_SEL,    GPIO_FUNC_SIO, false, false, true, true, true);  // Disable ctrl in mux
        gpio_conf(IDE_IORDY_EN,   GPIO_FUNC_SIO, false, false, true, true, true);  // Disable IORDY out
        gpio_conf(IDE_IOCS16,     GPIO_FUNC_SIO, false, false, true, true, true);  // Disable IOCS16 out
        gpio_conf(IDE_DATADIR,    GPIO_FUNC_SIO, false, false, true, false, true); // Data input
        gpio_conf(IDE_DATASEL,    GPIO_FUNC_SIO, false, false, true, false, true); // Enable data buffer
    }

    g_sniffer_enabled = true;
    return rp2350_sniffer_init(filename, passive);
}

void platform_sniffer_poll()
{
    rp2350_sniffer_poll();
}

/*************************************************/
/* SDK overrides for running in non-secure mode  */
/*************************************************/

#ifdef ARM_NONSECURE_MODE
// When the main firmware runs under ARM TrustZone, we must
// override some SDK functions. These have already been
// initialized by the bootloader.

extern "C" void runtime_init_bootrom_reset()
{
}

extern "C" void runtime_init_early_resets()
{
}

extern "C" void runtime_init_post_clock_resets()
{
    // JTAG and TBMAN peripherals are secure access only,
    // so we have to mask them out of reset.
    unreset_block_mask_wait_blocking(0x1fbffeff);
}

extern "C" void runtime_init_boot_locks_reset()
{
}

extern "C" void runtime_init_bootrom_locking_enable()
{
}

extern "C" void runtime_init_per_core_bootrom_reset()
{
}

#endif

// These functions are not used for SDIO mode but are needed to avoid build error.
void sdCsInit(SdCsPin_t pin) {}
void sdCsWrite(SdCsPin_t pin, bool level) {}

// SDIO configuration for main program
SdioConfig g_sd_sdio_config(DMA_SDIO);

void platform_set_sd_callback(sd_callback_t func, const uint8_t *buffer)
{
    rp2350_sdio_sdfat_set_callback(func, buffer);
}
